{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "1978492b",
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "import pandas as pd\n",
    "\n",
    "from utilities import neo4j_utilities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "faafeb9a",
   "metadata": {},
   "outputs": [],
   "source": [
    "from tqdm.notebook import tqdm\n",
    "from tqdm import tqdm as progress_tqdm\n",
    "tqdm.pandas()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "c7c2b531",
   "metadata": {},
   "outputs": [],
   "source": [
    "api_key = \"...\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b9669d3c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Connect to the Neo4j database\n",
    "graph = Graph(\"bolt://localhost:7687\", name = \"smallstc\", auth=(\"neo4j\", \"Stargate90\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "90a86b92",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:doi)\n",
    "RETURN a.title as title, a.abstract as abstract, a.languages AS languages, a.type AS type, a.tags as tags, a.name as doi\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "ad6b6e0b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Execute the query\n",
    "data = graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "23d38300",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Convert the result to a DataFrame\n",
    "df = pd.DataFrame(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "78e6b7f7",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clean_articles = df.dropna(subset=['title'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "3fd4d5d7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Index: 20666 entries, 0 to 372181\n",
      "Data columns (total 6 columns):\n",
      " #   Column     Non-Null Count  Dtype \n",
      "---  ------     --------------  ----- \n",
      " 0   title      20666 non-null  object\n",
      " 1   abstract   6603 non-null   object\n",
      " 2   languages  20072 non-null  object\n",
      " 3   type       20662 non-null  object\n",
      " 4   tags       18065 non-null  object\n",
      " 5   doi        20666 non-null  object\n",
      "dtypes: object(6)\n",
      "memory usage: 1.1+ MB\n"
     ]
    }
   ],
   "source": [
    "df_clean_articles.info()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fc75e058",
   "metadata": {},
   "source": [
    "## Preprocessing: Filling missing article language using LLM"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "cb9bf273",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>abstract</th>\n",
       "      <th>languages</th>\n",
       "      <th>type</th>\n",
       "      <th>tags</th>\n",
       "      <th>doi</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>616</th>\n",
       "      <td>Medical Malpractice and Black-Box Medicine</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>book-chapter</td>\n",
       "      <td>None</td>\n",
       "      <td>10.1017/9781108147972.027</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1114</th>\n",
       "      <td>Feature Visualization</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>[General Materials Science]</td>\n",
       "      <td>10.23915/distill.00007</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1942</th>\n",
       "      <td>Prescription Drug Monitoring Programs: Examini...</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>[General Medicine, Emergency Medicine]</td>\n",
       "      <td>10.5811/westjem.2014.10.24197</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3597</th>\n",
       "      <td>Mass spectrometry</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>[Biochemistry, Molecular Biology, Structural B...</td>\n",
       "      <td>10.1002/(sici)1097-0134(1998)33:2+&lt;1::aid-prot...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3638</th>\n",
       "      <td>[26] Raster3D: Photorealistic molecular graphics</td>\n",
       "      <td>This chapter discusses Raster3D, which is a su...</td>\n",
       "      <td>None</td>\n",
       "      <td>book-chapter</td>\n",
       "      <td>None</td>\n",
       "      <td>10.1016/s0076-6879(97)77028-9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>351285</th>\n",
       "      <td>HLT-FBK: a Complete Temporal Processing System...</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>proceedings-article</td>\n",
       "      <td>None</td>\n",
       "      <td>10.18653/v1/s15-2135</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>351286</th>\n",
       "      <td>HCTI at SemEval-2017 Task 1: Use convolutional...</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>proceedings-article</td>\n",
       "      <td>None</td>\n",
       "      <td>10.18653/v1/s17-2016</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>351834</th>\n",
       "      <td>Multilingual semantic role labeling</td>\n",
       "      <td>This paper describes our contribution to the s...</td>\n",
       "      <td>None</td>\n",
       "      <td>proceedings-article</td>\n",
       "      <td>None</td>\n",
       "      <td>10.3115/1596409.1596416</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>351838</th>\n",
       "      <td>International standard for a linguistic annota...</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>proceedings-article</td>\n",
       "      <td>None</td>\n",
       "      <td>10.3115/1119226.1119230</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>365872</th>\n",
       "      <td>Positive effect of hydroxychloroquine on lipid...</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>[Psychiatry and Mental health, Neuropsychology...</td>\n",
       "      <td>10.5152/eurjrheum.2020.20193</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>594 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    title  \\\n",
       "616            Medical Malpractice and Black-Box Medicine   \n",
       "1114                                Feature Visualization   \n",
       "1942    Prescription Drug Monitoring Programs: Examini...   \n",
       "3597                                    Mass spectrometry   \n",
       "3638     [26] Raster3D: Photorealistic molecular graphics   \n",
       "...                                                   ...   \n",
       "351285  HLT-FBK: a Complete Temporal Processing System...   \n",
       "351286  HCTI at SemEval-2017 Task 1: Use convolutional...   \n",
       "351834                Multilingual semantic role labeling   \n",
       "351838  International standard for a linguistic annota...   \n",
       "365872  Positive effect of hydroxychloroquine on lipid...   \n",
       "\n",
       "                                                 abstract languages  \\\n",
       "616                                                  None      None   \n",
       "1114                                                 None      None   \n",
       "1942                                                 None      None   \n",
       "3597                                                 None      None   \n",
       "3638    This chapter discusses Raster3D, which is a su...      None   \n",
       "...                                                   ...       ...   \n",
       "351285                                               None      None   \n",
       "351286                                               None      None   \n",
       "351834  This paper describes our contribution to the s...      None   \n",
       "351838                                               None      None   \n",
       "365872                                               None      None   \n",
       "\n",
       "                       type  \\\n",
       "616            book-chapter   \n",
       "1114        journal-article   \n",
       "1942        journal-article   \n",
       "3597        journal-article   \n",
       "3638           book-chapter   \n",
       "...                     ...   \n",
       "351285  proceedings-article   \n",
       "351286  proceedings-article   \n",
       "351834  proceedings-article   \n",
       "351838  proceedings-article   \n",
       "365872      journal-article   \n",
       "\n",
       "                                                     tags  \\\n",
       "616                                                  None   \n",
       "1114                          [General Materials Science]   \n",
       "1942               [General Medicine, Emergency Medicine]   \n",
       "3597    [Biochemistry, Molecular Biology, Structural B...   \n",
       "3638                                                 None   \n",
       "...                                                   ...   \n",
       "351285                                               None   \n",
       "351286                                               None   \n",
       "351834                                               None   \n",
       "351838                                               None   \n",
       "365872  [Psychiatry and Mental health, Neuropsychology...   \n",
       "\n",
       "                                                      doi  \n",
       "616                             10.1017/9781108147972.027  \n",
       "1114                               10.23915/distill.00007  \n",
       "1942                        10.5811/westjem.2014.10.24197  \n",
       "3597    10.1002/(sici)1097-0134(1998)33:2+<1::aid-prot...  \n",
       "3638                        10.1016/s0076-6879(97)77028-9  \n",
       "...                                                   ...  \n",
       "351285                               10.18653/v1/s15-2135  \n",
       "351286                               10.18653/v1/s17-2016  \n",
       "351834                            10.3115/1596409.1596416  \n",
       "351838                            10.3115/1119226.1119230  \n",
       "365872                       10.5152/eurjrheum.2020.20193  \n",
       "\n",
       "[594 rows x 6 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_clean_articles[df_clean_articles['languages'].isna()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "27b9e673",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'en,de,no,da,fr,it,nl,jv,lb,af,zu,la,cy,ca,gl,et,es,fil,sn,ga,fy,sv,pt,el,ceb,yo,el-Latn,ng,ny,co,gd,ru-Latn'"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "language_options = \",\".join([x[0] for x in list(df_clean_articles['languages'].value_counts().keys())])\n",
    "language_options"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "1bb8cd7e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "from langchain.prompts import ChatPromptTemplate\n",
    "\n",
    "llm = ChatOpenAI(model=\"gpt-3.5-turbo\", api_key=api_key, temperature=0)\n",
    "\n",
    "template = \"\"\"\n",
    "Return the language of the article by title: {title}. \n",
    "\"\"\" + f\"Available options: {language_options}\"\n",
    "\n",
    "language_prompt = ChatPromptTemplate.from_template(template)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "84ebf016",
   "metadata": {},
   "outputs": [],
   "source": [
    "language_chain = language_prompt | llm | StrOutputParser()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "5c502502",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Medical Malpractice and Black-Box Medicine'"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "_t = df_clean_articles[df_clean_articles['languages'].isna()].iloc[0, 0]\n",
    "_t "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "24a91996",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'en'"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "language_chain.invoke({\"title\": _t})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "918ecf5b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "96f8ea534cb8495e96f7e957c2da435c",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "  0%|          | 0/20666 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_165583/4044245384.py:1: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  df_clean_articles['languages'] = df_clean_articles.progress_apply(\n"
     ]
    }
   ],
   "source": [
    "df_clean_articles['languages'] = df_clean_articles.progress_apply(\n",
    "    lambda row: [language_chain.invoke({\"title\": row['title']})] if pd.isna(row['languages']) else row['languages'], axis=1 #\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "0f71d44b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Index: 20666 entries, 0 to 372181\n",
      "Data columns (total 6 columns):\n",
      " #   Column     Non-Null Count  Dtype \n",
      "---  ------     --------------  ----- \n",
      " 0   title      20666 non-null  object\n",
      " 1   abstract   6603 non-null   object\n",
      " 2   languages  20666 non-null  object\n",
      " 3   type       20662 non-null  object\n",
      " 4   tags       18065 non-null  object\n",
      " 5   doi        20666 non-null  object\n",
      "dtypes: object(6)\n",
      "memory usage: 1.1+ MB\n"
     ]
    }
   ],
   "source": [
    "df_clean_articles.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "7f7ad8f8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "languages\n",
       "[en]         20523\n",
       "[de]            18\n",
       "[no]            11\n",
       "[da]            11\n",
       "[fr]            10\n",
       "[it]            10\n",
       "[nl]             7\n",
       "[jv]             6\n",
       "[af]             6\n",
       "[lb]             6\n",
       "[zu]             5\n",
       "[la]             5\n",
       "[ca]             4\n",
       "[gu]             4\n",
       "[es]             4\n",
       "[cy]             4\n",
       "[et]             4\n",
       "[gl]             4\n",
       "[fil]            3\n",
       "[pt]             2\n",
       "[fy]             2\n",
       "[el]             2\n",
       "[sn]             2\n",
       "[sv]             2\n",
       "[ga]             2\n",
       "[yo]             1\n",
       "[ar]             1\n",
       "[ceb]            1\n",
       "[el-Latn]        1\n",
       "[co]             1\n",
       "[ng]             1\n",
       "[gd]             1\n",
       "[ny]             1\n",
       "[ru-Latn]        1\n",
       "Name: count, dtype: int64"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_clean_articles['languages'].value_counts()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "68db438e",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clean_articles.to_csv(\"languages_filled.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d87d6cfc",
   "metadata": {},
   "source": [
    "## Preprocessing: Creating tag anthology using LLM"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "637ee2df",
   "metadata": {},
   "outputs": [],
   "source": [
    "unique_tags = set(value for sublist in df['tags'] if sublist is not None for value in sublist)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "9c2bf268",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['',\n",
       " 'Probability',\n",
       " 'Diathermy',\n",
       " 'Dextran Sulfate',\n",
       " 'Nursing (miscellaneous)',\n",
       " 'Anthrax',\n",
       " 'Health Care Surveys',\n",
       " 'Medical Records',\n",
       " 'Verbal Behavior',\n",
       " 'Language',\n",
       " 'E-mail',\n",
       " 'Self Care',\n",
       " 'Double-Blind Method',\n",
       " 'Adaptation, Psychological',\n",
       " 'Multidisciplinary',\n",
       " 'Stem Cells',\n",
       " 'Mannose-Binding Lectins',\n",
       " 'Bone Neoplasms',\n",
       " 'Estrogens, Conjugated (USP)',\n",
       " 'Molecular Medicine']"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list(unique_tags)[:20]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "e3f5d84a",
   "metadata": {},
   "outputs": [],
   "source": [
    "llm = ChatOpenAI(model=\"gpt-4o\", api_key=api_key, temperature=0)\n",
    "\n",
    "template = \"\"\"You will be given a set of article tags. \n",
    "Your task is to create and return a 3/4-level anthology\n",
    "to be used to further map the tags.\n",
    "\n",
    "Article tags: {tags}\n",
    "\n",
    "Make sure to include all tags into the anthology\n",
    "Return the anthology as nested python dictionary\"\"\"\n",
    "\n",
    "anthology_prompt = ChatPromptTemplate.from_template(template)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "02363cbb",
   "metadata": {},
   "outputs": [],
   "source": [
    "anthology_chain = anthology_prompt | llm | StrOutputParser()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "047a894a",
   "metadata": {},
   "outputs": [],
   "source": [
    "tag_anthology = anthology_chain.invoke({\"tags\": unique_tags})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "3d03190a",
   "metadata": {},
   "outputs": [],
   "source": [
    "with open('anthology.txt', 'w') as f:\n",
    "    f.write(tag_anthology)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "53dadfc1",
   "metadata": {},
   "source": [
    "## Authors"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "e3dd6a16",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.embeddings.sentence_transformer import SentenceTransformerEmbeddings\n",
    "embedding = SentenceTransformerEmbeddings()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "5d6018ce",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:author)-[:author]->(d:doi)\n",
    "RETURN a.given AS given, a.family AS family, collect(d.title) AS titles\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "0d87e444",
   "metadata": {},
   "outputs": [],
   "source": [
    "data = graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "f4363f41",
   "metadata": {},
   "outputs": [],
   "source": [
    "df = pd.DataFrame(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "7da53d0c",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clean_authors = df.dropna(subset=['family'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "da2c44d7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(94092, 3)"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_clean_authors.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "cd4e9810",
   "metadata": {},
   "outputs": [],
   "source": [
    "def is_not_empty_list(lst):\n",
    "    return len(lst) > 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "1529f627",
   "metadata": {},
   "outputs": [],
   "source": [
    "# clean authors with not articles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "10a6d879",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clean_authors = df_clean_authors[df_clean_authors['titles'].apply(is_not_empty_list)]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "d0340678",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>given</th>\n",
       "      <th>family</th>\n",
       "      <th>titles</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1114</th>\n",
       "      <td>None</td>\n",
       "      <td>The Tobacco Use and Dependence Clinical Practi...</td>\n",
       "      <td>[A Clinical Practice Guideline for Treating To...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1120</th>\n",
       "      <td>None</td>\n",
       "      <td>for the Evidence-Based Medicine Working Group</td>\n",
       "      <td>[Users' Guides to the Medical Literature: XXII...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1129</th>\n",
       "      <td>None</td>\n",
       "      <td>for the CONSORT Group</td>\n",
       "      <td>[Use of the CONSORT Statement and Quality of R...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11586</th>\n",
       "      <td>None</td>\n",
       "      <td>SHARP Collaborative Group</td>\n",
       "      <td>[Study of Heart and Renal Protection (SHARP): ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22676</th>\n",
       "      <td>None</td>\n",
       "      <td>ChatGPT</td>\n",
       "      <td>[Open artificial intelligence platforms in nur...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30474</th>\n",
       "      <td>None</td>\n",
       "      <td>Madhusudan</td>\n",
       "      <td>[A transient interaction between two phosphore...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30960</th>\n",
       "      <td>None</td>\n",
       "      <td>The Lancet Infectious Diseases</td>\n",
       "      <td>[The COVID-19 infodemic]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31762</th>\n",
       "      <td>None</td>\n",
       "      <td>The Lancet Digital Health</td>\n",
       "      <td>[ChatGPT: friend or foe?]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36228</th>\n",
       "      <td>None</td>\n",
       "      <td>NHLBI Exome Sequencing Project</td>\n",
       "      <td>[Analysis of 6,515 exomes reveals the recent o...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47385</th>\n",
       "      <td>None</td>\n",
       "      <td>Prem Ramaswami</td>\n",
       "      <td>[A randomized controlled trial of online sympt...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48737</th>\n",
       "      <td>None</td>\n",
       "      <td>Sobral</td>\n",
       "      <td>[An appraisal of medical students' reflection-...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48741</th>\n",
       "      <td>None</td>\n",
       "      <td>Harden</td>\n",
       "      <td>[Task-based learning: the answer to integratio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48742</th>\n",
       "      <td>None</td>\n",
       "      <td>Crosby</td>\n",
       "      <td>[Task-based learning: the answer to integratio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48743</th>\n",
       "      <td>None</td>\n",
       "      <td>Davis</td>\n",
       "      <td>[Task-based learning: the answer to integratio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48744</th>\n",
       "      <td>None</td>\n",
       "      <td>Howie</td>\n",
       "      <td>[Task-based learning: the answer to integratio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48745</th>\n",
       "      <td>None</td>\n",
       "      <td>Struthers</td>\n",
       "      <td>[Task-based learning: the answer to integratio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52856</th>\n",
       "      <td>None</td>\n",
       "      <td>Willyanto</td>\n",
       "      <td>[Protein sequence design by conformational lan...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63990</th>\n",
       "      <td>None</td>\n",
       "      <td>Hyosig Kang</td>\n",
       "      <td>[Robotic assistants aid surgeons during minima...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64047</th>\n",
       "      <td>None</td>\n",
       "      <td>Ding Huang</td>\n",
       "      <td>[Interword distance changes represented by sin...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64048</th>\n",
       "      <td>None</td>\n",
       "      <td>Hong Yan</td>\n",
       "      <td>[SCS: Signal, Context, and Structure Features ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65506</th>\n",
       "      <td>None</td>\n",
       "      <td>May Liu</td>\n",
       "      <td>[Towards integrating task information in skill...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65524</th>\n",
       "      <td>None</td>\n",
       "      <td>Guang-Zhong Yang</td>\n",
       "      <td>[Cooperative in situ microscopic scanning and ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65600</th>\n",
       "      <td>None</td>\n",
       "      <td>Zhuo Zhang</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65601</th>\n",
       "      <td>None</td>\n",
       "      <td>Feng Shou Yin</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65602</th>\n",
       "      <td>None</td>\n",
       "      <td>Jiang Liu</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65603</th>\n",
       "      <td>None</td>\n",
       "      <td>Wing Kee Wong</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65604</th>\n",
       "      <td>None</td>\n",
       "      <td>Ngan Meng Tan</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65605</th>\n",
       "      <td>None</td>\n",
       "      <td>Beng Hai Lee</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65606</th>\n",
       "      <td>None</td>\n",
       "      <td>Jun Cheng</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65607</th>\n",
       "      <td>None</td>\n",
       "      <td>Tien Yin Wong</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65911</th>\n",
       "      <td>None</td>\n",
       "      <td>Xiong Yang</td>\n",
       "      <td>[I2T: Image Parsing to Text Description]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65912</th>\n",
       "      <td>None</td>\n",
       "      <td>Liang Lin</td>\n",
       "      <td>[I2T: Image Parsing to Text Description]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65913</th>\n",
       "      <td>None</td>\n",
       "      <td>Mun Wai Lee</td>\n",
       "      <td>[I2T: Image Parsing to Text Description]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65914</th>\n",
       "      <td>None</td>\n",
       "      <td>Song-Chun Zhu</td>\n",
       "      <td>[I2T: Image Parsing to Text Description]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66115</th>\n",
       "      <td>None</td>\n",
       "      <td>Xiao-Yu Fu</td>\n",
       "      <td>[Superhuman performance of surgical tasks by r...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66198</th>\n",
       "      <td>None</td>\n",
       "      <td>Dong Yu</td>\n",
       "      <td>[Context-Dependent Pre-Trained Deep Neural Net...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66199</th>\n",
       "      <td>None</td>\n",
       "      <td>Li Deng</td>\n",
       "      <td>[Context-Dependent Pre-Trained Deep Neural Net...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66309</th>\n",
       "      <td>None</td>\n",
       "      <td>Jia Zeng</td>\n",
       "      <td>[SCS: Signal, Context, and Structure Features ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66310</th>\n",
       "      <td>None</td>\n",
       "      <td>Xiao-Yu Zhao</td>\n",
       "      <td>[SCS: Signal, Context, and Structure Features ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66311</th>\n",
       "      <td>None</td>\n",
       "      <td>Xiao-Qin Cao</td>\n",
       "      <td>[SCS: Signal, Context, and Structure Features ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66316</th>\n",
       "      <td>None</td>\n",
       "      <td>Nguyen Ha Vo</td>\n",
       "      <td>[Efficient Extraction of Protein-Protein Inter...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66604</th>\n",
       "      <td>None</td>\n",
       "      <td>Qin Li</td>\n",
       "      <td>[Retinopathy Online Challenge: Automatic Detec...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66612</th>\n",
       "      <td>None</td>\n",
       "      <td>Yuanjie Zheng</td>\n",
       "      <td>[N4ITK: Improved N3 Bias Correction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66938</th>\n",
       "      <td>None</td>\n",
       "      <td>Minlong Lin</td>\n",
       "      <td>[Dynamic Sampling Approach to Training Neural ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66939</th>\n",
       "      <td>None</td>\n",
       "      <td>Ke Tang</td>\n",
       "      <td>[Dynamic Sampling Approach to Training Neural ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66940</th>\n",
       "      <td>None</td>\n",
       "      <td>Xin Yao</td>\n",
       "      <td>[Dynamic Sampling Approach to Training Neural ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66982</th>\n",
       "      <td>None</td>\n",
       "      <td>Zhuowen Tu</td>\n",
       "      <td>[Auto-Context and Its Application to High-Leve...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66983</th>\n",
       "      <td>None</td>\n",
       "      <td>Xiang Bai</td>\n",
       "      <td>[Auto-Context and Its Application to High-Leve...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66987</th>\n",
       "      <td>None</td>\n",
       "      <td>Lixin Duan</td>\n",
       "      <td>[Domain Transfer Multiple Kernel Learning]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66989</th>\n",
       "      <td>None</td>\n",
       "      <td>Dong Xu</td>\n",
       "      <td>[Domain Transfer Multiple Kernel Learning]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70748</th>\n",
       "      <td>None</td>\n",
       "      <td>Miklos</td>\n",
       "      <td>[Comparative Genomics of the Eukaryotes, The G...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88077</th>\n",
       "      <td>None</td>\n",
       "      <td>Abhilash B</td>\n",
       "      <td>[Comparison of visual acuity measured by ETDRS...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89164</th>\n",
       "      <td>None</td>\n",
       "      <td>Jennifer Robinson</td>\n",
       "      <td>[Role of colesevelam in managing heterozygous ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89165</th>\n",
       "      <td>None</td>\n",
       "      <td>Paul Milani</td>\n",
       "      <td>[Role of colesevelam in managing heterozygous ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89192</th>\n",
       "      <td>None</td>\n",
       "      <td>Brenu</td>\n",
       "      <td>[The prevalence of chronic fatigue syndrome/ m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89194</th>\n",
       "      <td>None</td>\n",
       "      <td>Marshall-Gradisnik</td>\n",
       "      <td>[The prevalence of chronic fatigue syndrome/ m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89223</th>\n",
       "      <td>None</td>\n",
       "      <td>Parlitsis</td>\n",
       "      <td>[Comparison of ultra-widefield fluorescein ang...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89224</th>\n",
       "      <td>None</td>\n",
       "      <td>Patel</td>\n",
       "      <td>[Comparison of ultra-widefield fluorescein ang...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      given                                             family  \\\n",
       "1114   None  The Tobacco Use and Dependence Clinical Practi...   \n",
       "1120   None      for the Evidence-Based Medicine Working Group   \n",
       "1129   None                              for the CONSORT Group   \n",
       "11586  None                          SHARP Collaborative Group   \n",
       "22676  None                                            ChatGPT   \n",
       "30474  None                                         Madhusudan   \n",
       "30960  None                     The Lancet Infectious Diseases   \n",
       "31762  None                          The Lancet Digital Health   \n",
       "36228  None                     NHLBI Exome Sequencing Project   \n",
       "47385  None                                     Prem Ramaswami   \n",
       "48737  None                                             Sobral   \n",
       "48741  None                                             Harden   \n",
       "48742  None                                             Crosby   \n",
       "48743  None                                              Davis   \n",
       "48744  None                                              Howie   \n",
       "48745  None                                          Struthers   \n",
       "52856  None                                          Willyanto   \n",
       "63990  None                                        Hyosig Kang   \n",
       "64047  None                                         Ding Huang   \n",
       "64048  None                                           Hong Yan   \n",
       "65506  None                                            May Liu   \n",
       "65524  None                                   Guang-Zhong Yang   \n",
       "65600  None                                         Zhuo Zhang   \n",
       "65601  None                                      Feng Shou Yin   \n",
       "65602  None                                          Jiang Liu   \n",
       "65603  None                                      Wing Kee Wong   \n",
       "65604  None                                      Ngan Meng Tan   \n",
       "65605  None                                       Beng Hai Lee   \n",
       "65606  None                                          Jun Cheng   \n",
       "65607  None                                      Tien Yin Wong   \n",
       "65911  None                                         Xiong Yang   \n",
       "65912  None                                          Liang Lin   \n",
       "65913  None                                        Mun Wai Lee   \n",
       "65914  None                                      Song-Chun Zhu   \n",
       "66115  None                                         Xiao-Yu Fu   \n",
       "66198  None                                            Dong Yu   \n",
       "66199  None                                            Li Deng   \n",
       "66309  None                                           Jia Zeng   \n",
       "66310  None                                       Xiao-Yu Zhao   \n",
       "66311  None                                       Xiao-Qin Cao   \n",
       "66316  None                                       Nguyen Ha Vo   \n",
       "66604  None                                             Qin Li   \n",
       "66612  None                                      Yuanjie Zheng   \n",
       "66938  None                                        Minlong Lin   \n",
       "66939  None                                            Ke Tang   \n",
       "66940  None                                            Xin Yao   \n",
       "66982  None                                         Zhuowen Tu   \n",
       "66983  None                                          Xiang Bai   \n",
       "66987  None                                         Lixin Duan   \n",
       "66989  None                                            Dong Xu   \n",
       "70748  None                                             Miklos   \n",
       "88077  None                                         Abhilash B   \n",
       "89164  None                                  Jennifer Robinson   \n",
       "89165  None                                        Paul Milani   \n",
       "89192  None                                              Brenu   \n",
       "89194  None                                 Marshall-Gradisnik   \n",
       "89223  None                                          Parlitsis   \n",
       "89224  None                                              Patel   \n",
       "\n",
       "                                                  titles  \n",
       "1114   [A Clinical Practice Guideline for Treating To...  \n",
       "1120   [Users' Guides to the Medical Literature: XXII...  \n",
       "1129   [Use of the CONSORT Statement and Quality of R...  \n",
       "11586  [Study of Heart and Renal Protection (SHARP): ...  \n",
       "22676  [Open artificial intelligence platforms in nur...  \n",
       "30474  [A transient interaction between two phosphore...  \n",
       "30960                           [The COVID-19 infodemic]  \n",
       "31762                          [ChatGPT: friend or foe?]  \n",
       "36228  [Analysis of 6,515 exomes reveals the recent o...  \n",
       "47385  [A randomized controlled trial of online sympt...  \n",
       "48737  [An appraisal of medical students' reflection-...  \n",
       "48741  [Task-based learning: the answer to integratio...  \n",
       "48742  [Task-based learning: the answer to integratio...  \n",
       "48743  [Task-based learning: the answer to integratio...  \n",
       "48744  [Task-based learning: the answer to integratio...  \n",
       "48745  [Task-based learning: the answer to integratio...  \n",
       "52856  [Protein sequence design by conformational lan...  \n",
       "63990  [Robotic assistants aid surgeons during minima...  \n",
       "64047  [Interword distance changes represented by sin...  \n",
       "64048  [SCS: Signal, Context, and Structure Features ...  \n",
       "65506  [Towards integrating task information in skill...  \n",
       "65524  [Cooperative in situ microscopic scanning and ...  \n",
       "65600  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65601  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65602  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65603  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65604  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65605  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65606  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65607  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65911           [I2T: Image Parsing to Text Description]  \n",
       "65912           [I2T: Image Parsing to Text Description]  \n",
       "65913           [I2T: Image Parsing to Text Description]  \n",
       "65914           [I2T: Image Parsing to Text Description]  \n",
       "66115  [Superhuman performance of surgical tasks by r...  \n",
       "66198  [Context-Dependent Pre-Trained Deep Neural Net...  \n",
       "66199  [Context-Dependent Pre-Trained Deep Neural Net...  \n",
       "66309  [SCS: Signal, Context, and Structure Features ...  \n",
       "66310  [SCS: Signal, Context, and Structure Features ...  \n",
       "66311  [SCS: Signal, Context, and Structure Features ...  \n",
       "66316  [Efficient Extraction of Protein-Protein Inter...  \n",
       "66604  [Retinopathy Online Challenge: Automatic Detec...  \n",
       "66612               [N4ITK: Improved N3 Bias Correction]  \n",
       "66938  [Dynamic Sampling Approach to Training Neural ...  \n",
       "66939  [Dynamic Sampling Approach to Training Neural ...  \n",
       "66940  [Dynamic Sampling Approach to Training Neural ...  \n",
       "66982  [Auto-Context and Its Application to High-Leve...  \n",
       "66983  [Auto-Context and Its Application to High-Leve...  \n",
       "66987         [Domain Transfer Multiple Kernel Learning]  \n",
       "66989         [Domain Transfer Multiple Kernel Learning]  \n",
       "70748  [Comparative Genomics of the Eukaryotes, The G...  \n",
       "88077  [Comparison of visual acuity measured by ETDRS...  \n",
       "89164  [Role of colesevelam in managing heterozygous ...  \n",
       "89165  [Role of colesevelam in managing heterozygous ...  \n",
       "89192  [The prevalence of chronic fatigue syndrome/ m...  \n",
       "89194  [The prevalence of chronic fatigue syndrome/ m...  \n",
       "89223  [Comparison of ultra-widefield fluorescein ang...  \n",
       "89224  [Comparison of ultra-widefield fluorescein ang...  "
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# sometimes the given name is in the family name, especially for single publication\n",
    "df_clean_authors[df_clean_authors['given'].isna()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "95fb7aca",
   "metadata": {},
   "outputs": [],
   "source": [
    "def word_count(text):\n",
    "    return len(text.split())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "915d8b40",
   "metadata": {},
   "outputs": [],
   "source": [
    "# remove coorporations from authors\n",
    "df_clean_authors = df_clean_authors[df_clean_authors['family'].apply(word_count) < 3]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "00458f4e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(44, 3)"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_clean_authors[df_clean_authors['given'].isna()].shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "4018b0d2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>given</th>\n",
       "      <th>family</th>\n",
       "      <th>titles</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>22676</th>\n",
       "      <td>None</td>\n",
       "      <td>ChatGPT</td>\n",
       "      <td>[Open artificial intelligence platforms in nur...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30474</th>\n",
       "      <td>None</td>\n",
       "      <td>Madhusudan</td>\n",
       "      <td>[A transient interaction between two phosphore...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47385</th>\n",
       "      <td>None</td>\n",
       "      <td>Prem Ramaswami</td>\n",
       "      <td>[A randomized controlled trial of online sympt...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48737</th>\n",
       "      <td>None</td>\n",
       "      <td>Sobral</td>\n",
       "      <td>[An appraisal of medical students' reflection-...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48741</th>\n",
       "      <td>None</td>\n",
       "      <td>Harden</td>\n",
       "      <td>[Task-based learning: the answer to integratio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48742</th>\n",
       "      <td>None</td>\n",
       "      <td>Crosby</td>\n",
       "      <td>[Task-based learning: the answer to integratio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48743</th>\n",
       "      <td>None</td>\n",
       "      <td>Davis</td>\n",
       "      <td>[Task-based learning: the answer to integratio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48744</th>\n",
       "      <td>None</td>\n",
       "      <td>Howie</td>\n",
       "      <td>[Task-based learning: the answer to integratio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48745</th>\n",
       "      <td>None</td>\n",
       "      <td>Struthers</td>\n",
       "      <td>[Task-based learning: the answer to integratio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52856</th>\n",
       "      <td>None</td>\n",
       "      <td>Willyanto</td>\n",
       "      <td>[Protein sequence design by conformational lan...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63990</th>\n",
       "      <td>None</td>\n",
       "      <td>Hyosig Kang</td>\n",
       "      <td>[Robotic assistants aid surgeons during minima...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64047</th>\n",
       "      <td>None</td>\n",
       "      <td>Ding Huang</td>\n",
       "      <td>[Interword distance changes represented by sin...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64048</th>\n",
       "      <td>None</td>\n",
       "      <td>Hong Yan</td>\n",
       "      <td>[SCS: Signal, Context, and Structure Features ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65506</th>\n",
       "      <td>None</td>\n",
       "      <td>May Liu</td>\n",
       "      <td>[Towards integrating task information in skill...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65524</th>\n",
       "      <td>None</td>\n",
       "      <td>Guang-Zhong Yang</td>\n",
       "      <td>[Cooperative in situ microscopic scanning and ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65600</th>\n",
       "      <td>None</td>\n",
       "      <td>Zhuo Zhang</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65602</th>\n",
       "      <td>None</td>\n",
       "      <td>Jiang Liu</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65606</th>\n",
       "      <td>None</td>\n",
       "      <td>Jun Cheng</td>\n",
       "      <td>[ORIGA&lt;sup&gt;-light&lt;/sup&gt;: An online retinal fun...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65911</th>\n",
       "      <td>None</td>\n",
       "      <td>Xiong Yang</td>\n",
       "      <td>[I2T: Image Parsing to Text Description]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65912</th>\n",
       "      <td>None</td>\n",
       "      <td>Liang Lin</td>\n",
       "      <td>[I2T: Image Parsing to Text Description]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65914</th>\n",
       "      <td>None</td>\n",
       "      <td>Song-Chun Zhu</td>\n",
       "      <td>[I2T: Image Parsing to Text Description]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66115</th>\n",
       "      <td>None</td>\n",
       "      <td>Xiao-Yu Fu</td>\n",
       "      <td>[Superhuman performance of surgical tasks by r...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66198</th>\n",
       "      <td>None</td>\n",
       "      <td>Dong Yu</td>\n",
       "      <td>[Context-Dependent Pre-Trained Deep Neural Net...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66199</th>\n",
       "      <td>None</td>\n",
       "      <td>Li Deng</td>\n",
       "      <td>[Context-Dependent Pre-Trained Deep Neural Net...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66309</th>\n",
       "      <td>None</td>\n",
       "      <td>Jia Zeng</td>\n",
       "      <td>[SCS: Signal, Context, and Structure Features ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66310</th>\n",
       "      <td>None</td>\n",
       "      <td>Xiao-Yu Zhao</td>\n",
       "      <td>[SCS: Signal, Context, and Structure Features ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66311</th>\n",
       "      <td>None</td>\n",
       "      <td>Xiao-Qin Cao</td>\n",
       "      <td>[SCS: Signal, Context, and Structure Features ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66604</th>\n",
       "      <td>None</td>\n",
       "      <td>Qin Li</td>\n",
       "      <td>[Retinopathy Online Challenge: Automatic Detec...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66612</th>\n",
       "      <td>None</td>\n",
       "      <td>Yuanjie Zheng</td>\n",
       "      <td>[N4ITK: Improved N3 Bias Correction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66938</th>\n",
       "      <td>None</td>\n",
       "      <td>Minlong Lin</td>\n",
       "      <td>[Dynamic Sampling Approach to Training Neural ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66939</th>\n",
       "      <td>None</td>\n",
       "      <td>Ke Tang</td>\n",
       "      <td>[Dynamic Sampling Approach to Training Neural ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66940</th>\n",
       "      <td>None</td>\n",
       "      <td>Xin Yao</td>\n",
       "      <td>[Dynamic Sampling Approach to Training Neural ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66982</th>\n",
       "      <td>None</td>\n",
       "      <td>Zhuowen Tu</td>\n",
       "      <td>[Auto-Context and Its Application to High-Leve...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66983</th>\n",
       "      <td>None</td>\n",
       "      <td>Xiang Bai</td>\n",
       "      <td>[Auto-Context and Its Application to High-Leve...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66987</th>\n",
       "      <td>None</td>\n",
       "      <td>Lixin Duan</td>\n",
       "      <td>[Domain Transfer Multiple Kernel Learning]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66989</th>\n",
       "      <td>None</td>\n",
       "      <td>Dong Xu</td>\n",
       "      <td>[Domain Transfer Multiple Kernel Learning]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70748</th>\n",
       "      <td>None</td>\n",
       "      <td>Miklos</td>\n",
       "      <td>[Comparative Genomics of the Eukaryotes, The G...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88077</th>\n",
       "      <td>None</td>\n",
       "      <td>Abhilash B</td>\n",
       "      <td>[Comparison of visual acuity measured by ETDRS...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89164</th>\n",
       "      <td>None</td>\n",
       "      <td>Jennifer Robinson</td>\n",
       "      <td>[Role of colesevelam in managing heterozygous ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89165</th>\n",
       "      <td>None</td>\n",
       "      <td>Paul Milani</td>\n",
       "      <td>[Role of colesevelam in managing heterozygous ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89192</th>\n",
       "      <td>None</td>\n",
       "      <td>Brenu</td>\n",
       "      <td>[The prevalence of chronic fatigue syndrome/ m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89194</th>\n",
       "      <td>None</td>\n",
       "      <td>Marshall-Gradisnik</td>\n",
       "      <td>[The prevalence of chronic fatigue syndrome/ m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89223</th>\n",
       "      <td>None</td>\n",
       "      <td>Parlitsis</td>\n",
       "      <td>[Comparison of ultra-widefield fluorescein ang...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89224</th>\n",
       "      <td>None</td>\n",
       "      <td>Patel</td>\n",
       "      <td>[Comparison of ultra-widefield fluorescein ang...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      given              family  \\\n",
       "22676  None             ChatGPT   \n",
       "30474  None          Madhusudan   \n",
       "47385  None      Prem Ramaswami   \n",
       "48737  None              Sobral   \n",
       "48741  None              Harden   \n",
       "48742  None              Crosby   \n",
       "48743  None               Davis   \n",
       "48744  None               Howie   \n",
       "48745  None           Struthers   \n",
       "52856  None           Willyanto   \n",
       "63990  None         Hyosig Kang   \n",
       "64047  None          Ding Huang   \n",
       "64048  None            Hong Yan   \n",
       "65506  None             May Liu   \n",
       "65524  None    Guang-Zhong Yang   \n",
       "65600  None          Zhuo Zhang   \n",
       "65602  None           Jiang Liu   \n",
       "65606  None           Jun Cheng   \n",
       "65911  None          Xiong Yang   \n",
       "65912  None           Liang Lin   \n",
       "65914  None       Song-Chun Zhu   \n",
       "66115  None          Xiao-Yu Fu   \n",
       "66198  None             Dong Yu   \n",
       "66199  None             Li Deng   \n",
       "66309  None            Jia Zeng   \n",
       "66310  None        Xiao-Yu Zhao   \n",
       "66311  None        Xiao-Qin Cao   \n",
       "66604  None              Qin Li   \n",
       "66612  None       Yuanjie Zheng   \n",
       "66938  None         Minlong Lin   \n",
       "66939  None             Ke Tang   \n",
       "66940  None             Xin Yao   \n",
       "66982  None          Zhuowen Tu   \n",
       "66983  None           Xiang Bai   \n",
       "66987  None          Lixin Duan   \n",
       "66989  None             Dong Xu   \n",
       "70748  None              Miklos   \n",
       "88077  None          Abhilash B   \n",
       "89164  None   Jennifer Robinson   \n",
       "89165  None         Paul Milani   \n",
       "89192  None               Brenu   \n",
       "89194  None  Marshall-Gradisnik   \n",
       "89223  None           Parlitsis   \n",
       "89224  None               Patel   \n",
       "\n",
       "                                                  titles  \n",
       "22676  [Open artificial intelligence platforms in nur...  \n",
       "30474  [A transient interaction between two phosphore...  \n",
       "47385  [A randomized controlled trial of online sympt...  \n",
       "48737  [An appraisal of medical students' reflection-...  \n",
       "48741  [Task-based learning: the answer to integratio...  \n",
       "48742  [Task-based learning: the answer to integratio...  \n",
       "48743  [Task-based learning: the answer to integratio...  \n",
       "48744  [Task-based learning: the answer to integratio...  \n",
       "48745  [Task-based learning: the answer to integratio...  \n",
       "52856  [Protein sequence design by conformational lan...  \n",
       "63990  [Robotic assistants aid surgeons during minima...  \n",
       "64047  [Interword distance changes represented by sin...  \n",
       "64048  [SCS: Signal, Context, and Structure Features ...  \n",
       "65506  [Towards integrating task information in skill...  \n",
       "65524  [Cooperative in situ microscopic scanning and ...  \n",
       "65600  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65602  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65606  [ORIGA<sup>-light</sup>: An online retinal fun...  \n",
       "65911           [I2T: Image Parsing to Text Description]  \n",
       "65912           [I2T: Image Parsing to Text Description]  \n",
       "65914           [I2T: Image Parsing to Text Description]  \n",
       "66115  [Superhuman performance of surgical tasks by r...  \n",
       "66198  [Context-Dependent Pre-Trained Deep Neural Net...  \n",
       "66199  [Context-Dependent Pre-Trained Deep Neural Net...  \n",
       "66309  [SCS: Signal, Context, and Structure Features ...  \n",
       "66310  [SCS: Signal, Context, and Structure Features ...  \n",
       "66311  [SCS: Signal, Context, and Structure Features ...  \n",
       "66604  [Retinopathy Online Challenge: Automatic Detec...  \n",
       "66612               [N4ITK: Improved N3 Bias Correction]  \n",
       "66938  [Dynamic Sampling Approach to Training Neural ...  \n",
       "66939  [Dynamic Sampling Approach to Training Neural ...  \n",
       "66940  [Dynamic Sampling Approach to Training Neural ...  \n",
       "66982  [Auto-Context and Its Application to High-Leve...  \n",
       "66983  [Auto-Context and Its Application to High-Leve...  \n",
       "66987         [Domain Transfer Multiple Kernel Learning]  \n",
       "66989         [Domain Transfer Multiple Kernel Learning]  \n",
       "70748  [Comparative Genomics of the Eukaryotes, The G...  \n",
       "88077  [Comparison of visual acuity measured by ETDRS...  \n",
       "89164  [Role of colesevelam in managing heterozygous ...  \n",
       "89165  [Role of colesevelam in managing heterozygous ...  \n",
       "89192  [The prevalence of chronic fatigue syndrome/ m...  \n",
       "89194  [The prevalence of chronic fatigue syndrome/ m...  \n",
       "89223  [Comparison of ultra-widefield fluorescein ang...  \n",
       "89224  [Comparison of ultra-widefield fluorescein ang...  "
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_clean_authors[df_clean_authors['given'].isna()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "959a605c",
   "metadata": {},
   "outputs": [],
   "source": [
    "given_names = df_clean_authors[df_clean_authors['given'].isna()]['family'].apply(lambda x: x.split(' ')[0] if len(x.split(' ')) == 2 else \"_\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "f5291e71",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "array(['_', '_', 'Prem', '_', '_', '_', '_', '_', '_', '_', 'Hyosig',\n",
       "       'Ding', 'Hong', 'May', 'Guang-Zhong', 'Zhuo', 'Jiang', 'Jun',\n",
       "       'Xiong', 'Liang', 'Song-Chun', 'Xiao-Yu', 'Dong', 'Li', 'Jia',\n",
       "       'Xiao-Yu', 'Xiao-Qin', 'Qin', 'Yuanjie', 'Minlong', 'Ke', 'Xin',\n",
       "       'Zhuowen', 'Xiang', 'Lixin', 'Dong', '_', 'Abhilash', 'Jennifer',\n",
       "       'Paul', '_', '_', '_', '_'], dtype=object)"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "given_names.values"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "bbf395cc",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clean_authors.loc[given_names.index, 'given'] = given_names.values"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "165cfb13",
   "metadata": {},
   "outputs": [],
   "source": [
    "# in some cases there is extra punctuation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "119f7750",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>given</th>\n",
       "      <th>family</th>\n",
       "      <th>titles</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>34480</th>\n",
       "      <td>J</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[A prognostic index in primary breast cancer]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10863</th>\n",
       "      <td>J.</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Crystallographic structure of an RNA helix: [...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59689</th>\n",
       "      <td>James</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[The MEME Suite, Diagnostic accuracy of X-ray ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85208</th>\n",
       "      <td>Jason M</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Mapping the Genetic Architecture of Gene Expr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87440</th>\n",
       "      <td>Jean</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Creating Opportunities for Parent Empowerment...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69566</th>\n",
       "      <td>Jeffery</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[The Sequence of the Human Genome]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73143</th>\n",
       "      <td>Jeffrey A</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[A meta-analysis of the association between ad...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9456</th>\n",
       "      <td>Jeffrey A.</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Understanding the complex associations betwee...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30094</th>\n",
       "      <td>Jeffrey C</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Beliefs about and responses to childhood ear ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74138</th>\n",
       "      <td>Jill R</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Effectiveness of screening colonoscopy in red...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33670</th>\n",
       "      <td>John E.</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Atomic structure of the 75 MDa extremophile\\n...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37467</th>\n",
       "      <td>Jon</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[The UK10K project identifies rare variants in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6652</th>\n",
       "      <td>Joseph O.</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Image Analysis of the Tumor Microenvironment]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7187</th>\n",
       "      <td>Judith P.</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Cell adhesion molecules of the immunoglobulin...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9553</th>\n",
       "      <td>Justin</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[CLEVR: A Diagnostic Dataset for Compositional...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83497</th>\n",
       "      <td>Justin M.</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Survey on deep learning with class imbalance]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            given   family                                             titles\n",
       "34480           J  Johnson      [A prognostic index in primary breast cancer]\n",
       "10863          J.  Johnson  [Crystallographic structure of an RNA helix: [...\n",
       "59689       James  Johnson  [The MEME Suite, Diagnostic accuracy of X-ray ...\n",
       "85208     Jason M  Johnson  [Mapping the Genetic Architecture of Gene Expr...\n",
       "87440        Jean  Johnson  [Creating Opportunities for Parent Empowerment...\n",
       "69566     Jeffery  Johnson                 [The Sequence of the Human Genome]\n",
       "73143   Jeffrey A  Johnson  [A meta-analysis of the association between ad...\n",
       "9456   Jeffrey A.  Johnson  [Understanding the complex associations betwee...\n",
       "30094   Jeffrey C  Johnson  [Beliefs about and responses to childhood ear ...\n",
       "74138      Jill R  Johnson  [Effectiveness of screening colonoscopy in red...\n",
       "33670     John E.  Johnson  [Atomic structure of the 75 MDa extremophile\\n...\n",
       "37467         Jon  Johnson  [The UK10K project identifies rare variants in...\n",
       "6652    Joseph O.  Johnson     [Image Analysis of the Tumor Microenvironment]\n",
       "7187    Judith P.  Johnson  [Cell adhesion molecules of the immunoglobulin...\n",
       "9553       Justin  Johnson  [CLEVR: A Diagnostic Dataset for Compositional...\n",
       "83497   Justin M.  Johnson     [Survey on deep learning with class imbalance]"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_clean_authors[(df_clean_authors['family'] == \"Johnson\") & (df_clean_authors['given'].str[0] == \"J\")].sort_values(['given'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "efb57af4",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clean_authors['given'] = df_clean_authors['given'].apply(lambda x: x.replace(\".\", \"\") if x else x)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "fb48bd1f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>given</th>\n",
       "      <th>family</th>\n",
       "      <th>titles</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>10863</th>\n",
       "      <td>J</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Crystallographic structure of an RNA helix: [...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34480</th>\n",
       "      <td>J</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[A prognostic index in primary breast cancer]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59689</th>\n",
       "      <td>James</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[The MEME Suite, Diagnostic accuracy of X-ray ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85208</th>\n",
       "      <td>Jason M</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Mapping the Genetic Architecture of Gene Expr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87440</th>\n",
       "      <td>Jean</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Creating Opportunities for Parent Empowerment...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69566</th>\n",
       "      <td>Jeffery</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[The Sequence of the Human Genome]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9456</th>\n",
       "      <td>Jeffrey A</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Understanding the complex associations betwee...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73143</th>\n",
       "      <td>Jeffrey A</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[A meta-analysis of the association between ad...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30094</th>\n",
       "      <td>Jeffrey C</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Beliefs about and responses to childhood ear ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74138</th>\n",
       "      <td>Jill R</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Effectiveness of screening colonoscopy in red...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33670</th>\n",
       "      <td>John E</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Atomic structure of the 75 MDa extremophile\\n...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37467</th>\n",
       "      <td>Jon</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[The UK10K project identifies rare variants in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6652</th>\n",
       "      <td>Joseph O</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Image Analysis of the Tumor Microenvironment]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7187</th>\n",
       "      <td>Judith P</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Cell adhesion molecules of the immunoglobulin...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9553</th>\n",
       "      <td>Justin</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[CLEVR: A Diagnostic Dataset for Compositional...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83497</th>\n",
       "      <td>Justin M</td>\n",
       "      <td>Johnson</td>\n",
       "      <td>[Survey on deep learning with class imbalance]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           given   family                                             titles\n",
       "10863          J  Johnson  [Crystallographic structure of an RNA helix: [...\n",
       "34480          J  Johnson      [A prognostic index in primary breast cancer]\n",
       "59689      James  Johnson  [The MEME Suite, Diagnostic accuracy of X-ray ...\n",
       "85208    Jason M  Johnson  [Mapping the Genetic Architecture of Gene Expr...\n",
       "87440       Jean  Johnson  [Creating Opportunities for Parent Empowerment...\n",
       "69566    Jeffery  Johnson                 [The Sequence of the Human Genome]\n",
       "9456   Jeffrey A  Johnson  [Understanding the complex associations betwee...\n",
       "73143  Jeffrey A  Johnson  [A meta-analysis of the association between ad...\n",
       "30094  Jeffrey C  Johnson  [Beliefs about and responses to childhood ear ...\n",
       "74138     Jill R  Johnson  [Effectiveness of screening colonoscopy in red...\n",
       "33670     John E  Johnson  [Atomic structure of the 75 MDa extremophile\\n...\n",
       "37467        Jon  Johnson  [The UK10K project identifies rare variants in...\n",
       "6652    Joseph O  Johnson     [Image Analysis of the Tumor Microenvironment]\n",
       "7187    Judith P  Johnson  [Cell adhesion molecules of the immunoglobulin...\n",
       "9553      Justin  Johnson  [CLEVR: A Diagnostic Dataset for Compositional...\n",
       "83497   Justin M  Johnson     [Survey on deep learning with class imbalance]"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_clean_authors[(df_clean_authors['family'] == \"Johnson\") & (df_clean_authors['given'].str[0] == \"J\")].sort_values(['given'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "c77149aa",
   "metadata": {},
   "outputs": [],
   "source": [
    "one_letter_name = df_clean_authors[df_clean_authors['given'].apply(lambda x: len(x.replace(\".\",\"\")) if x else 0) == 1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "d47426ee",
   "metadata": {},
   "outputs": [],
   "source": [
    "def concatenate_lists(series):\n",
    "    return series.sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "613911f2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Group by 'given' and 'family' columns and concatenate lists in grouped rows\n",
    "grouped_df = df_clean_authors.groupby(['given', 'family']).agg({\n",
    "    'titles': concatenate_lists,\n",
    "}).reset_index()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "63b3e21d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(91429, 3)"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "grouped_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "63aa7d33",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[0.039591751992702484,\n",
       " -0.07843189686536789,\n",
       " 0.026333099231123924,\n",
       " 0.03865569829940796,\n",
       " 0.004176840651780367,\n",
       " 0.022404426708817482,\n",
       " -0.0013168402947485447,\n",
       " 0.008029144257307053,\n",
       " -0.003868338419124484,\n",
       " -0.015063636936247349]"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "embedding.embed_query(\"; \".join(grouped_df.iloc[0,-1]))[:10]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "938fcf92",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "ddd9f18ee1414dc2964805b562a55315",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "  0%|          | 0/91429 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "embeddings = grouped_df['titles'].progress_apply(lambda x: embedding.embed_query(\"; \".join(x)))\n",
    "grouped_df['embeddings'] = embeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "2b9e9ab2",
   "metadata": {},
   "outputs": [],
   "source": [
    "grouped_df.to_csv(\"embedding_authors_3.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "dedab10b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>given</th>\n",
       "      <th>family</th>\n",
       "      <th>titles</th>\n",
       "      <th>embeddings</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(The Late) B</td>\n",
       "      <td>Tilander</td>\n",
       "      <td>[Crystal structure of human erythrocyte carbon...</td>\n",
       "      <td>[0.039591751992702484, -0.07843189686536789, 0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>&gt;</td>\n",
       "      <td>Kleeff</td>\n",
       "      <td>[Insulin-Like Growth Factor Signaling as a The...</td>\n",
       "      <td>[0.05088701471686363, -0.012295341119170189, 0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>??eslovas</td>\n",
       "      <td>Venclovas</td>\n",
       "      <td>[Assessment of progress over the CASP experime...</td>\n",
       "      <td>[-0.046196773648262024, -0.009418211877346039,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>?eslovas</td>\n",
       "      <td>Venclovas</td>\n",
       "      <td>[Processing and analysis of CASP3 protein stru...</td>\n",
       "      <td>[-0.037653807550668716, -0.04398495331406593, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>A</td>\n",
       "      <td>ANDERSON</td>\n",
       "      <td>[Cancer patients' concerns regarding access to...</td>\n",
       "      <td>[0.05151272565126419, 0.06267254054546356, -0....</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          given     family                                             titles  \\\n",
       "0  (The Late) B   Tilander  [Crystal structure of human erythrocyte carbon...   \n",
       "1             >     Kleeff  [Insulin-Like Growth Factor Signaling as a The...   \n",
       "2     ??eslovas  Venclovas  [Assessment of progress over the CASP experime...   \n",
       "3      ?eslovas  Venclovas  [Processing and analysis of CASP3 protein stru...   \n",
       "4             A   ANDERSON  [Cancer patients' concerns regarding access to...   \n",
       "\n",
       "                                          embeddings  \n",
       "0  [0.039591751992702484, -0.07843189686536789, 0...  \n",
       "1  [0.05088701471686363, -0.012295341119170189, 0...  \n",
       "2  [-0.046196773648262024, -0.009418211877346039,...  \n",
       "3  [-0.037653807550668716, -0.04398495331406593, ...  \n",
       "4  [0.05151272565126419, 0.06267254054546356, -0....  "
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "grouped_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "9d062ae8",
   "metadata": {},
   "outputs": [],
   "source": [
    "from sklearn.metrics.pairwise import cosine_similarity\n",
    "def process_single_letter_names(df, similarity_threshold=0.75):\n",
    "    # Group by family name\n",
    "    grouped = df.groupby('family')\n",
    "\n",
    "    # Prepare a list to store the final results\n",
    "    results = []\n",
    "\n",
    "    for family_name, group in progress_tqdm(grouped):\n",
    "        # Find single-letter given names\n",
    "        single_letter_names = group[group['given'].str.len() == 1]\n",
    "\n",
    "        # Process each single-letter given name\n",
    "        for _, single_letter_row in single_letter_names.iterrows():\n",
    "            single_letter_embedding = single_letter_row['embeddings']\n",
    "            single_letter_given = single_letter_row['given']\n",
    "\n",
    "            # Compare with other given names in the same family\n",
    "            for _, row in group.iterrows():\n",
    "                if row['given'] != single_letter_given and (row['given'][0] == single_letter_given or single_letter_given == \"_\"):\n",
    "                    other_embedding = row['embeddings']\n",
    "                    similarity = cosine_similarity(\n",
    "                        [single_letter_embedding], [other_embedding]\n",
    "                    )[0][0]\n",
    "                    if similarity > similarity_threshold:\n",
    "                        results.append({\n",
    "                            'given': single_letter_given,\n",
    "                            'family': family_name,\n",
    "                            'matched_given': row['given'],\n",
    "                            'similarity': similarity\n",
    "                        })\n",
    "\n",
    "    return pd.DataFrame(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "85ddca69",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|███████████████████████████████████████████████████████████████████████████████████████████████████████████| 45765/45765 [01:08<00:00, 672.57it/s]\n"
     ]
    }
   ],
   "source": [
    "candidates_df = process_single_letter_names(grouped_df, similarity_threshold=0.7)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "e0f2f3ae",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0      Gonçalo R\n",
       "1           Linn\n",
       "2          Keith\n",
       "3           Faiz\n",
       "4           Kaat\n",
       "5          Kevin\n",
       "6            S J\n",
       "7      Stephen J\n",
       "8         Younes\n",
       "9          Joana\n",
       "10     Stephen F\n",
       "11        Sophia\n",
       "12       Richard\n",
       "13      Fumihito\n",
       "14       Susan G\n",
       "15        Michal\n",
       "16        Alvaro\n",
       "17         Helen\n",
       "18         Elena\n",
       "19         Chris\n",
       "20       Gillian\n",
       "21         Marin\n",
       "22         Helen\n",
       "23       Helen M\n",
       "24     Christian\n",
       "25        Andrew\n",
       "26       Agatino\n",
       "27       Jessica\n",
       "28        Hugues\n",
       "29       Roberto\n",
       "30           Tom\n",
       "31      Catalina\n",
       "32       Valérie\n",
       "33      Adrian P\n",
       "34     Charlotte\n",
       "35       Andreas\n",
       "36         Nadia\n",
       "37      Miloslav\n",
       "38        Thomas\n",
       "39         Sally\n",
       "40     Florian P\n",
       "41          Sean\n",
       "42       Jessica\n",
       "43        Andrew\n",
       "44       Monique\n",
       "45        Durado\n",
       "46          Dirk\n",
       "47     Matthew J\n",
       "48          Timo\n",
       "49    Philippe M\n",
       "Name: matched_given, dtype: object"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "candidates_df['matched_given'].head(50)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "17b015e3",
   "metadata": {},
   "outputs": [],
   "source": [
    "candidates_df.to_csv(\"candidates.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "412a71ed",
   "metadata": {},
   "source": [
    "## Applying Preprocessing"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "490a6afa",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Connect to the Neo4j database\n",
    "graph = Graph(\"bolt://localhost:7687\", name = \"smallstc\", auth=(\"neo4j\", \"Stargate90\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "097f2971",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_clean_articles = pd.read_csv(\"languages_filled.csv\", index_col=[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "d46dd81b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>abstract</th>\n",
       "      <th>languages</th>\n",
       "      <th>type</th>\n",
       "      <th>tags</th>\n",
       "      <th>doi</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Information Overload and Missed Test Results i...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['en']</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>['Internal Medicine']</td>\n",
       "      <td>10.1001/2013.jamainternmed.61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Ethical Dimensions of Using Artificial Intelli...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['en']</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>['Health (social science)', 'Health Policy', '...</td>\n",
       "      <td>10.1001/amajethics.2019.121</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Should Watson Be Consulted for a Second Opinion?</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['en']</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>['Health (social science)', 'Health Policy', '...</td>\n",
       "      <td>10.1001/amajethics.2019.131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>How Should Clinicians Communicate With Patient...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['en']</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>['Health (social science)', 'Health Policy', '...</td>\n",
       "      <td>10.1001/amajethics.2019.138</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Are Current Tort Liability Doctrines Adequate ...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['en']</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>['Health (social science)', 'Health Policy', '...</td>\n",
       "      <td>10.1001/amajethics.2019.160</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>367240</th>\n",
       "      <td>Socioeconomic deprivation scores as predictors...</td>\n",
       "      <td>Background\\nA previous study found that variab...</td>\n",
       "      <td>['en']</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>['Family Practice']</td>\n",
       "      <td>10.3399/bjgp19x704549</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>367277</th>\n",
       "      <td>Level or not?</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['en']</td>\n",
       "      <td>report</td>\n",
       "      <td>NaN</td>\n",
       "      <td>10.37829/hf-2020-rc13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>368135</th>\n",
       "      <td>Understanding and using sensitivity, specifici...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['en']</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>['Ophthalmology']</td>\n",
       "      <td>10.4103/0301-4738.41424</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>372050</th>\n",
       "      <td>Cervical Pessary for Preventing Preterm Birth ...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['en']</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>['Radiology, Nuclear Medicine and imaging', 'R...</td>\n",
       "      <td>10.7863/ultra.16.08054</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>372181</th>\n",
       "      <td>Factors associated with attendance at primary ...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['en']</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>['General Medicine']</td>\n",
       "      <td>10.9778/cmajo.20180069</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>20666 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    title  \\\n",
       "0       Information Overload and Missed Test Results i...   \n",
       "1       Ethical Dimensions of Using Artificial Intelli...   \n",
       "2        Should Watson Be Consulted for a Second Opinion?   \n",
       "3       How Should Clinicians Communicate With Patient...   \n",
       "4       Are Current Tort Liability Doctrines Adequate ...   \n",
       "...                                                   ...   \n",
       "367240  Socioeconomic deprivation scores as predictors...   \n",
       "367277                                      Level or not?   \n",
       "368135  Understanding and using sensitivity, specifici...   \n",
       "372050  Cervical Pessary for Preventing Preterm Birth ...   \n",
       "372181  Factors associated with attendance at primary ...   \n",
       "\n",
       "                                                 abstract languages  \\\n",
       "0                                                     NaN    ['en']   \n",
       "1                                                     NaN    ['en']   \n",
       "2                                                     NaN    ['en']   \n",
       "3                                                     NaN    ['en']   \n",
       "4                                                     NaN    ['en']   \n",
       "...                                                   ...       ...   \n",
       "367240  Background\\nA previous study found that variab...    ['en']   \n",
       "367277                                                NaN    ['en']   \n",
       "368135                                                NaN    ['en']   \n",
       "372050                                                NaN    ['en']   \n",
       "372181                                                NaN    ['en']   \n",
       "\n",
       "                   type                                               tags  \\\n",
       "0       journal-article                              ['Internal Medicine']   \n",
       "1       journal-article  ['Health (social science)', 'Health Policy', '...   \n",
       "2       journal-article  ['Health (social science)', 'Health Policy', '...   \n",
       "3       journal-article  ['Health (social science)', 'Health Policy', '...   \n",
       "4       journal-article  ['Health (social science)', 'Health Policy', '...   \n",
       "...                 ...                                                ...   \n",
       "367240  journal-article                                ['Family Practice']   \n",
       "367277           report                                                NaN   \n",
       "368135  journal-article                                  ['Ophthalmology']   \n",
       "372050  journal-article  ['Radiology, Nuclear Medicine and imaging', 'R...   \n",
       "372181  journal-article                               ['General Medicine']   \n",
       "\n",
       "                                  doi  \n",
       "0       10.1001/2013.jamainternmed.61  \n",
       "1         10.1001/amajethics.2019.121  \n",
       "2         10.1001/amajethics.2019.131  \n",
       "3         10.1001/amajethics.2019.138  \n",
       "4         10.1001/amajethics.2019.160  \n",
       "...                               ...  \n",
       "367240          10.3399/bjgp19x704549  \n",
       "367277          10.37829/hf-2020-rc13  \n",
       "368135        10.4103/0301-4738.41424  \n",
       "372050         10.7863/ultra.16.08054  \n",
       "372181         10.9778/cmajo.20180069  \n",
       "\n",
       "[20666 rows x 6 columns]"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_clean_articles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "c3dbc8b6",
   "metadata": {},
   "outputs": [],
   "source": [
    "candidates_df = pd.read_csv(\"candidates.csv\", index_col=[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "12544ae0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>given</th>\n",
       "      <th>family</th>\n",
       "      <th>matched_given</th>\n",
       "      <th>similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>G</td>\n",
       "      <td>Abecasis</td>\n",
       "      <td>Gonçalo R</td>\n",
       "      <td>0.823202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>L</td>\n",
       "      <td>Abraham</td>\n",
       "      <td>Linn</td>\n",
       "      <td>0.800957</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>K</td>\n",
       "      <td>Abrams</td>\n",
       "      <td>Keith</td>\n",
       "      <td>0.799398</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>F</td>\n",
       "      <td>Ahmad Khan</td>\n",
       "      <td>Faiz</td>\n",
       "      <td>0.769182</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>K</td>\n",
       "      <td>Alaerts</td>\n",
       "      <td>Kaat</td>\n",
       "      <td>0.867004</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>452</th>\n",
       "      <td>C</td>\n",
       "      <td>Zywietz</td>\n",
       "      <td>Christoph</td>\n",
       "      <td>0.714291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>453</th>\n",
       "      <td>M</td>\n",
       "      <td>de Boer</td>\n",
       "      <td>Maaike</td>\n",
       "      <td>0.868919</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>454</th>\n",
       "      <td>M</td>\n",
       "      <td>de Jonge</td>\n",
       "      <td>Maretha</td>\n",
       "      <td>0.782835</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>455</th>\n",
       "      <td>M</td>\n",
       "      <td>de Mathelin</td>\n",
       "      <td>MF</td>\n",
       "      <td>0.771620</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>456</th>\n",
       "      <td>B</td>\n",
       "      <td>van Ginneken</td>\n",
       "      <td>Bram</td>\n",
       "      <td>0.878928</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>457 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    given        family matched_given  similarity\n",
       "0       G      Abecasis     Gonçalo R    0.823202\n",
       "1       L       Abraham          Linn    0.800957\n",
       "2       K        Abrams         Keith    0.799398\n",
       "3       F    Ahmad Khan          Faiz    0.769182\n",
       "4       K       Alaerts          Kaat    0.867004\n",
       "..    ...           ...           ...         ...\n",
       "452     C       Zywietz     Christoph    0.714291\n",
       "453     M       de Boer        Maaike    0.868919\n",
       "454     M      de Jonge       Maretha    0.782835\n",
       "455     M   de Mathelin            MF    0.771620\n",
       "456     B  van Ginneken          Bram    0.878928\n",
       "\n",
       "[457 rows x 4 columns]"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "candidates_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "9f72cd18",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:doi)\n",
    "OPTIONAL MATCH (a)-[:reference]->(ref:doi)\n",
    "RETURN a.title AS title, \n",
    "       a.abstract AS abstract, \n",
    "       a.languages AS languages, \n",
    "       a.type AS type, \n",
    "       a.tags AS tags,\n",
    "       a.updated_at AS updated_at, \n",
    "       a.container_title AS container_title, \n",
    "       a.is_content_present AS is_content_present,\n",
    "       a.name AS doi, \n",
    "       a.issued_at AS issued_at,\n",
    "       collect(ref.name) AS references\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "62775e64",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Execute the query\n",
    "data = graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "ece69ea5",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Convert the result to a DataFrame\n",
    "doi_df = pd.DataFrame(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "473f0227",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:author)-[:author]->(d:doi)\n",
    "RETURN a.given AS given, a.family AS family, a.orcid as orcid, d.name as doi, a.id_hash as id_hash\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "10e19fc0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Execute the query\n",
    "data = graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "6103184e",
   "metadata": {},
   "outputs": [],
   "source": [
    "author_df = pd.DataFrame(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "ba37d4a0",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_df = pd.merge(author_df, doi_df, on=\"doi\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "5fc4f663",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_df.drop(['languages'], axis=1, inplace=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "f45bdf31",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_df = result_df.dropna(subset=['family'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "e3d1e4a1",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_df['given'] = result_df['given'].apply(lambda x: x.replace(\".\", \"\") if (x and len(x) >= 3) else x)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "f15412d5",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_df = pd.merge(result_df, df_clean_articles[['doi', 'languages']], on=\"doi\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "6234e45c",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_df = pd.merge(result_df, candidates_df[['given','family','matched_given']], on=['given','family'], how=\"left\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "fdab2fa5",
   "metadata": {},
   "outputs": [],
   "source": [
    "def is_nan(value):\n",
    "    return pd.isna(value)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "88e93361",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_df[\"given\"] = result_df.apply(lambda x: x['matched_given'] if not is_nan(x['matched_given']) else x['given'], axis=1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "8567c055",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_df.drop(\"matched_given\", axis=1, inplace=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "id": "c83775cd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>given</th>\n",
       "      <th>family</th>\n",
       "      <th>orcid</th>\n",
       "      <th>doi</th>\n",
       "      <th>id_hash</th>\n",
       "      <th>title</th>\n",
       "      <th>abstract</th>\n",
       "      <th>type</th>\n",
       "      <th>tags</th>\n",
       "      <th>updated_at</th>\n",
       "      <th>container_title</th>\n",
       "      <th>is_content_present</th>\n",
       "      <th>issued_at</th>\n",
       "      <th>references</th>\n",
       "      <th>languages</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hardeep</td>\n",
       "      <td>Singh</td>\n",
       "      <td>None</td>\n",
       "      <td>10.1001/2013.jamainternmed.61</td>\n",
       "      <td>b985366129f0c2a7e0ba05e5de448161963c124b684400...</td>\n",
       "      <td>Information Overload and Missed Test Results i...</td>\n",
       "      <td>None</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>[Internal Medicine]</td>\n",
       "      <td>1.695848e+09</td>\n",
       "      <td>JAMA Internal Medicine</td>\n",
       "      <td>False</td>\n",
       "      <td>1.366589e+09</td>\n",
       "      <td>[]</td>\n",
       "      <td>['en']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hardeep</td>\n",
       "      <td>Singh</td>\n",
       "      <td>None</td>\n",
       "      <td>10.1001/jamainternmed.2013.2777</td>\n",
       "      <td>b985366129f0c2a7e0ba05e5de448161963c124b684400...</td>\n",
       "      <td>Types and Origins of Diagnostic Errors in Prim...</td>\n",
       "      <td>None</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>[Internal Medicine]</td>\n",
       "      <td>1.695840e+09</td>\n",
       "      <td>JAMA Internal Medicine</td>\n",
       "      <td>False</td>\n",
       "      <td>1.364170e+09</td>\n",
       "      <td>[]</td>\n",
       "      <td>['en']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Christiane</td>\n",
       "      <td>Spitzmueller</td>\n",
       "      <td>None</td>\n",
       "      <td>10.1001/2013.jamainternmed.61</td>\n",
       "      <td>1028cd415ed3557f212fb355330f99ff25253215b48e35...</td>\n",
       "      <td>Information Overload and Missed Test Results i...</td>\n",
       "      <td>None</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>[Internal Medicine]</td>\n",
       "      <td>1.695848e+09</td>\n",
       "      <td>JAMA Internal Medicine</td>\n",
       "      <td>False</td>\n",
       "      <td>1.366589e+09</td>\n",
       "      <td>[]</td>\n",
       "      <td>['en']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Nancy J</td>\n",
       "      <td>Petersen</td>\n",
       "      <td>None</td>\n",
       "      <td>10.1001/2013.jamainternmed.61</td>\n",
       "      <td>160a8b32b0df7105d254186517dfb2aab0c1c3418744a4...</td>\n",
       "      <td>Information Overload and Missed Test Results i...</td>\n",
       "      <td>None</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>[Internal Medicine]</td>\n",
       "      <td>1.695848e+09</td>\n",
       "      <td>JAMA Internal Medicine</td>\n",
       "      <td>False</td>\n",
       "      <td>1.366589e+09</td>\n",
       "      <td>[]</td>\n",
       "      <td>['en']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Mona K</td>\n",
       "      <td>Sawhney</td>\n",
       "      <td>None</td>\n",
       "      <td>10.1001/2013.jamainternmed.61</td>\n",
       "      <td>addfa31adbe848ff77d9f120cc42ae3cef02e4574ff5b9...</td>\n",
       "      <td>Information Overload and Missed Test Results i...</td>\n",
       "      <td>None</td>\n",
       "      <td>journal-article</td>\n",
       "      <td>[Internal Medicine]</td>\n",
       "      <td>1.695848e+09</td>\n",
       "      <td>JAMA Internal Medicine</td>\n",
       "      <td>False</td>\n",
       "      <td>1.366589e+09</td>\n",
       "      <td>[]</td>\n",
       "      <td>['en']</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        given        family orcid                              doi  \\\n",
       "0     Hardeep         Singh  None    10.1001/2013.jamainternmed.61   \n",
       "1     Hardeep         Singh  None  10.1001/jamainternmed.2013.2777   \n",
       "2  Christiane  Spitzmueller  None    10.1001/2013.jamainternmed.61   \n",
       "3     Nancy J      Petersen  None    10.1001/2013.jamainternmed.61   \n",
       "4      Mona K       Sawhney  None    10.1001/2013.jamainternmed.61   \n",
       "\n",
       "                                             id_hash  \\\n",
       "0  b985366129f0c2a7e0ba05e5de448161963c124b684400...   \n",
       "1  b985366129f0c2a7e0ba05e5de448161963c124b684400...   \n",
       "2  1028cd415ed3557f212fb355330f99ff25253215b48e35...   \n",
       "3  160a8b32b0df7105d254186517dfb2aab0c1c3418744a4...   \n",
       "4  addfa31adbe848ff77d9f120cc42ae3cef02e4574ff5b9...   \n",
       "\n",
       "                                               title abstract  \\\n",
       "0  Information Overload and Missed Test Results i...     None   \n",
       "1  Types and Origins of Diagnostic Errors in Prim...     None   \n",
       "2  Information Overload and Missed Test Results i...     None   \n",
       "3  Information Overload and Missed Test Results i...     None   \n",
       "4  Information Overload and Missed Test Results i...     None   \n",
       "\n",
       "              type                 tags    updated_at         container_title  \\\n",
       "0  journal-article  [Internal Medicine]  1.695848e+09  JAMA Internal Medicine   \n",
       "1  journal-article  [Internal Medicine]  1.695840e+09  JAMA Internal Medicine   \n",
       "2  journal-article  [Internal Medicine]  1.695848e+09  JAMA Internal Medicine   \n",
       "3  journal-article  [Internal Medicine]  1.695848e+09  JAMA Internal Medicine   \n",
       "4  journal-article  [Internal Medicine]  1.695848e+09  JAMA Internal Medicine   \n",
       "\n",
       "  is_content_present     issued_at references languages  \n",
       "0              False  1.366589e+09         []    ['en']  \n",
       "1              False  1.364170e+09         []    ['en']  \n",
       "2              False  1.366589e+09         []    ['en']  \n",
       "3              False  1.366589e+09         []    ['en']  \n",
       "4              False  1.366589e+09         []    ['en']  "
      ]
     },
     "execution_count": 79,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "b300c470",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['given', 'family', 'orcid', 'doi', 'id_hash', 'title', 'abstract',\n",
       "       'type', 'tags', 'updated_at', 'container_title', 'is_content_present',\n",
       "       'issued_at', 'references', 'languages'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 80,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result_df.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "f01679d3",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_df.to_csv(\"result_df.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78de0a86",
   "metadata": {},
   "source": [
    "## Upload to neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "99e9df47",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[Database.ExistingDatabaseFound] Failed to create the specified database 'smallstc-upd': Database name or alias already exists.\n"
     ]
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "system_graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"Stargate90\"), name=\"system\")\n",
    "\n",
    "# Create the new database \"updated graph\" if it doesn't exist\n",
    "try:\n",
    "    system_graph.run(\"CREATE DATABASE `smallstc-upd`\")\n",
    "except Exception as e:\n",
    "    print(e)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "7bc6a014",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"Stargate90\"), name=\"smallstc-upd\")\n",
    "try:\n",
    "    graph.run(\"MATCH (n) DETACH DELETE n\")\n",
    "except Exception as e:\n",
    "    print(e)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "2a0fde3e",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_author_nodes(row):\n",
    "    author = Node(\"author\", given=row['given'], family=row['family'], orcid=row['orcid'], id_hash=row[\"id_hash\"])\n",
    "    return author\n",
    "\n",
    "def create_article_nodes(row):\n",
    "    article = Node(\"article\", doi=row['doi'], title=row['title'], abstract=row['abstract'], \n",
    "                   type=row['type'], tags=row['tags'], updated_at=row['updated_at'], \n",
    "                   container_title=row['container_title'], is_content_present=row['is_content_present'], \n",
    "                   issued_at=row['issued_at'], languages=row['languages'])\n",
    "    return article"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "f385a77d",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "137905it [3:42:44, 10.32it/s]\n"
     ]
    }
   ],
   "source": [
    "from py2neo import Node, Relationship\n",
    "\n",
    "for idx, row in progress_tqdm(result_df.iterrows()):\n",
    "    author = create_author_nodes(row)\n",
    "    article = create_article_nodes(row)\n",
    "\n",
    "    # Merge nodes to avoid duplicates\n",
    "    graph.merge(author, \"author\", \"id_hash\")\n",
    "    graph.merge(article, \"article\", \"doi\")\n",
    "\n",
    "    # Create relationships between author and article\n",
    "    written_by = Relationship(article, \"AUTHORED_BY\", author)\n",
    "    graph.create(written_by)\n",
    "\n",
    "    # Optionally: Add tags as nodes and create relationships to articles\n",
    "    if row['tags']:\n",
    "        tags = row['tags']\n",
    "        for tag in tags:\n",
    "            tag_node = Node(\"tag\", name=tag.strip())\n",
    "            graph.merge(tag_node, \"tag\", \"name\")\n",
    "            tagged_with = Relationship(article, \"TAGGED_WITH\", tag_node)\n",
    "            graph.create(tagged_with)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "af484281",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      " 12%|████████████▎                                                                                           | 7109/59896 [7:05:50<52:42:02,  3.59s/it]\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[66], line 25\u001b[0m\n\u001b[1;32m     22\u001b[0m df \u001b[38;5;241m=\u001b[39m result_df[[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mdoi\u001b[39m\u001b[38;5;124m'\u001b[39m, \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mreferences\u001b[39m\u001b[38;5;124m'\u001b[39m]]\u001b[38;5;241m.\u001b[39mexplode(\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mreferences\u001b[39m\u001b[38;5;124m'\u001b[39m)\u001b[38;5;241m.\u001b[39mdropna()        \n\u001b[1;32m     24\u001b[0m \u001b[38;5;66;03m# Call the function with the flattened DataFrame\u001b[39;00m\n\u001b[0;32m---> 25\u001b[0m \u001b[43mcreate_relationships_in_batches\u001b[49m\u001b[43m(\u001b[49m\u001b[43mdf\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mbatch_size\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;241;43m100\u001b[39;49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[0;32mIn[66], line 20\u001b[0m, in \u001b[0;36mcreate_relationships_in_batches\u001b[0;34m(df, batch_size)\u001b[0m\n\u001b[1;32m     18\u001b[0m end \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mmin\u001b[39m(start \u001b[38;5;241m+\u001b[39m batch_size, total_rows)\n\u001b[1;32m     19\u001b[0m batch \u001b[38;5;241m=\u001b[39m df\u001b[38;5;241m.\u001b[39miloc[start:end]\u001b[38;5;241m.\u001b[39mto_dict(\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mrecords\u001b[39m\u001b[38;5;124m'\u001b[39m)\n\u001b[0;32m---> 20\u001b[0m \u001b[43mgraph\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery_template\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mrows\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mbatch\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/.local/lib/python3.10/site-packages/py2neo/database.py:405\u001b[0m, in \u001b[0;36mGraph.run\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    395\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mrun\u001b[39m(\u001b[38;5;28mself\u001b[39m, cypher, parameters\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwparameters):\n\u001b[1;32m    396\u001b[0m \u001b[38;5;250m    \u001b[39m\u001b[38;5;124;03m\"\"\" Run a single read/write query within an auto-commit\u001b[39;00m\n\u001b[1;32m    397\u001b[0m \u001b[38;5;124;03m    :class:`~py2neo.Transaction`.\u001b[39;00m\n\u001b[1;32m    398\u001b[0m \n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    403\u001b[0m \u001b[38;5;124;03m    :return:\u001b[39;00m\n\u001b[1;32m    404\u001b[0m \u001b[38;5;124;03m    \"\"\"\u001b[39;00m\n\u001b[0;32m--> 405\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mauto\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mcypher\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwparameters\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/.local/lib/python3.10/site-packages/py2neo/database.py:992\u001b[0m, in \u001b[0;36mTransaction.run\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    988\u001b[0m     \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m    989\u001b[0m         result \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connector\u001b[38;5;241m.\u001b[39mauto_run(cypher, parameters,\n\u001b[1;32m    990\u001b[0m                                           graph_name\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mgraph\u001b[38;5;241m.\u001b[39mname,\n\u001b[1;32m    991\u001b[0m                                           readonly\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mreadonly)\n\u001b[0;32m--> 992\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connector\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpull\u001b[49m\u001b[43m(\u001b[49m\u001b[43mresult\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m-\u001b[39;49m\u001b[38;5;241;43m1\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[1;32m    993\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m Cursor(result, hydrant)\n\u001b[1;32m    994\u001b[0m \u001b[38;5;28;01mfinally\u001b[39;00m:\n",
      "File \u001b[0;32m~/.local/lib/python3.10/site-packages/py2neo/client/__init__.py:1434\u001b[0m, in \u001b[0;36mConnector.pull\u001b[0;34m(self, result, n)\u001b[0m\n\u001b[1;32m   1432\u001b[0m cx \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_reacquire(result\u001b[38;5;241m.\u001b[39mtransaction)\n\u001b[1;32m   1433\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m-> 1434\u001b[0m     \u001b[43mcx\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpull\u001b[49m\u001b[43m(\u001b[49m\u001b[43mresult\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mn\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mn\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m   1435\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ConnectionUnavailable, ConnectionBroken):\n\u001b[1;32m   1436\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprune(cx\u001b[38;5;241m.\u001b[39mprofile)\n",
      "File \u001b[0;32m~/.local/lib/python3.10/site-packages/py2neo/client/bolt.py:995\u001b[0m, in \u001b[0;36mBolt4x0.pull\u001b[0;34m(self, result, n, capacity)\u001b[0m\n\u001b[1;32m    993\u001b[0m result\u001b[38;5;241m.\u001b[39mappend(response, final\u001b[38;5;241m=\u001b[39m(n \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m1\u001b[39m))\n\u001b[1;32m    994\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 995\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_sync\u001b[49m\u001b[43m(\u001b[49m\u001b[43mresponse\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    996\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m BrokenWireError \u001b[38;5;28;01mas\u001b[39;00m error:\n\u001b[1;32m    997\u001b[0m     result\u001b[38;5;241m.\u001b[39mtransaction\u001b[38;5;241m.\u001b[39mmark_broken()\n",
      "File \u001b[0;32m~/.local/lib/python3.10/site-packages/py2neo/client/bolt.py:799\u001b[0m, in \u001b[0;36mBolt1._sync\u001b[0;34m(self, *responses)\u001b[0m\n\u001b[1;32m    797\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39msend()\n\u001b[1;32m    798\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m response \u001b[38;5;129;01min\u001b[39;00m responses:\n\u001b[0;32m--> 799\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_wait\u001b[49m\u001b[43m(\u001b[49m\u001b[43mresponse\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/.local/lib/python3.10/site-packages/py2neo/client/bolt.py:794\u001b[0m, in \u001b[0;36mBolt1._wait\u001b[0;34m(self, response)\u001b[0m\n\u001b[1;32m    787\u001b[0m \u001b[38;5;250m\u001b[39m\u001b[38;5;124;03m\"\"\" Read all incoming responses up to and including a\u001b[39;00m\n\u001b[1;32m    788\u001b[0m \u001b[38;5;124;03mparticular response.\u001b[39;00m\n\u001b[1;32m    789\u001b[0m \n\u001b[1;32m    790\u001b[0m \u001b[38;5;124;03mThis method calls fetch, but does not raise an exception on\u001b[39;00m\n\u001b[1;32m    791\u001b[0m \u001b[38;5;124;03mFAILURE.\u001b[39;00m\n\u001b[1;32m    792\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    793\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m response\u001b[38;5;241m.\u001b[39mfull() \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m response\u001b[38;5;241m.\u001b[39mdone():\n\u001b[0;32m--> 794\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_fetch\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/.local/lib/python3.10/site-packages/py2neo/client/bolt.py:769\u001b[0m, in \u001b[0;36mBolt1._fetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    760\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21m_fetch\u001b[39m(\u001b[38;5;28mself\u001b[39m):\n\u001b[1;32m    761\u001b[0m \u001b[38;5;250m    \u001b[39m\u001b[38;5;124;03m\"\"\" Fetch and process the next incoming message.\u001b[39;00m\n\u001b[1;32m    762\u001b[0m \n\u001b[1;32m    763\u001b[0m \u001b[38;5;124;03m    This method does not raise an exception on receipt of a\u001b[39;00m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    767\u001b[0m \u001b[38;5;124;03m    failed state into an exception.\u001b[39;00m\n\u001b[1;32m    768\u001b[0m \u001b[38;5;124;03m    \"\"\"\u001b[39;00m\n\u001b[0;32m--> 769\u001b[0m     tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mread_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    770\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m tag \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0x70\u001b[39m:\n\u001b[1;32m    771\u001b[0m         \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_responses\u001b[38;5;241m.\u001b[39mpopleft()\u001b[38;5;241m.\u001b[39mset_success(\u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mfields[\u001b[38;5;241m0\u001b[39m])\n",
      "File \u001b[0;32m~/.local/lib/python3.10/site-packages/py2neo/client/bolt.py:696\u001b[0m, in \u001b[0;36mBolt1.read_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    695\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mread_message\u001b[39m(\u001b[38;5;28mself\u001b[39m):\n\u001b[0;32m--> 696\u001b[0m     tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_reader\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mread_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    697\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m tag \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0x71\u001b[39m:\n\u001b[1;32m    698\u001b[0m         \u001b[38;5;66;03m# If a RECORD is received, check for more records\u001b[39;00m\n\u001b[1;32m    699\u001b[0m         \u001b[38;5;66;03m# in the buffer immediately following, and log and\u001b[39;00m\n\u001b[1;32m    700\u001b[0m         \u001b[38;5;66;03m# add them all at the same time\u001b[39;00m\n\u001b[1;32m    701\u001b[0m         \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_reader\u001b[38;5;241m.\u001b[39mpeek_message() \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0x71\u001b[39m:\n",
      "File \u001b[0;32m~/.local/lib/python3.10/site-packages/py2neo/client/bolt.py:156\u001b[0m, in \u001b[0;36mBoltMessageReader.read_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    154\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28;01mTrue\u001b[39;00m:\n\u001b[1;32m    155\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 156\u001b[0m         hi, lo \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mwire\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mread\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m2\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[1;32m    157\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m WireError \u001b[38;5;28;01mas\u001b[39;00m error:\n\u001b[1;32m    158\u001b[0m         raise_from(ConnectionBroken(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mFailed to read message\u001b[39m\u001b[38;5;124m\"\u001b[39m), error)\n",
      "File \u001b[0;32m~/.local/lib/python3.10/site-packages/py2neo/wiring.py:117\u001b[0m, in \u001b[0;36mWire.read\u001b[0;34m(self, n)\u001b[0m\n\u001b[1;32m    115\u001b[0m requested \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mmax\u001b[39m(required, \u001b[38;5;241m16384\u001b[39m)\n\u001b[1;32m    116\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 117\u001b[0m     received \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m__socket\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrecv\u001b[49m\u001b[43m(\u001b[49m\u001b[43mrequested\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    118\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (\u001b[38;5;167;01mIOError\u001b[39;00m, \u001b[38;5;167;01mOSError\u001b[39;00m):\n\u001b[1;32m    119\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__mark_broken(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mWire broken\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "'''for idx, row in progress_tqdm(result_df[['doi', 'references']].explode('references').dropna().iterrows()):\n",
    "    ref_article = graph.nodes.match(\"article\", doi=row['references']).first()\n",
    "    doi_article = graph.nodes.match(\"article\", doi=row['doi']).first()\n",
    "    if ref_article and doi_article:\n",
    "        graph.create(Relationship(doi_article, \"REFERENCES\", ref_article))\n",
    "'''\n",
    "        \n",
    "        \n",
    "        \n",
    "def create_relationships_in_batches(df, batch_size=100):\n",
    "    query_template = \"\"\"\n",
    "    UNWIND $rows AS row\n",
    "    MATCH (a:article {doi: row.doi}), (r:article {doi: row.references})\n",
    "    MERGE (a)-[:REFERENCES]->(r)\n",
    "    \"\"\"\n",
    "    total_rows = len(df)\n",
    "    for start in progress_tqdm(range(0, total_rows, batch_size)):\n",
    "        end = min(start + batch_size, total_rows)\n",
    "        batch = df.iloc[start:end].to_dict('records')\n",
    "        graph.run(query_template, rows=batch)\n",
    "\n",
    "df = result_df[['doi', 'references']].explode('references').dropna()        \n",
    "        \n",
    "# Call the function with the flattened DataFrame\n",
    "create_relationships_in_batches(df, batch_size=100)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "id": "0d8a8e97",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "with open(\"anthology.json\", 'r') as f:\n",
    "    tag_anthology = json.load(f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "4ef7cbee",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Recursive function to create nodes and relationships in Neo4j\n",
    "def create_relationships(parent_name, children):\n",
    "    if isinstance(children, dict):\n",
    "        for child_name, grand_children in children.items():\n",
    "            parent_node = Node(\"tag\", name=parent_name)\n",
    "            child_node = Node(\"tag\", name=child_name)\n",
    "            graph.merge(parent_node, \"tag\", \"name\")\n",
    "            graph.merge(child_node, \"tag\", \"name\")\n",
    "            related_to = Relationship(child_node, \"RELATED_TO\", parent_node)\n",
    "            graph.merge(related_to)\n",
    "            create_relationships(child_name, grand_children)\n",
    "    elif isinstance(children, list):\n",
    "        parent_node = Node(\"tag\", name=parent_name)\n",
    "        graph.merge(parent_node, \"tag\", \"name\")\n",
    "        for child_name in children:\n",
    "            child_node = Node(\"tag\", name=child_name)\n",
    "            graph.merge(child_node, \"tag\", \"name\")\n",
    "            related_to = Relationship(child_node, \"RELATED_TO\", parent_node)\n",
    "            graph.merge(related_to)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "c7273a3d",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 6/6 [00:04<00:00,  1.42it/s]\n"
     ]
    }
   ],
   "source": [
    "for root_tag, sub_tags in progress_tqdm(tag_anthology.items()):\n",
    "    create_relationships(root_tag, sub_tags)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "8ffcee07",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>doi</th>\n",
       "      <th>references</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>10.1016/j.amjmed.2011.07.029</td>\n",
       "      <td>10.1200/jop.091098</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>10.1016/j.amjmed.2011.07.029</td>\n",
       "      <td>10.1001/archinte.163.21.2625</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>10.1016/j.amjmed.2011.07.029</td>\n",
       "      <td>10.1046/j.1365-2710.2002.00434.x</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>10.1016/j.amjmed.2011.07.029</td>\n",
       "      <td>10.1097/01.jac.0000290402.89284.a9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>10.1016/j.amjmed.2011.07.029</td>\n",
       "      <td>10.1197/jamia.m3200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>137886</th>\n",
       "      <td>10.7863/ultra.34.2.225</td>\n",
       "      <td>10.1097/sla.0b013e318204a892</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>137886</th>\n",
       "      <td>10.7863/ultra.34.2.225</td>\n",
       "      <td>10.1016/s0002-9610(03)00042-4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>137886</th>\n",
       "      <td>10.7863/ultra.34.2.225</td>\n",
       "      <td>10.1186/1471-2407-9-335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>137886</th>\n",
       "      <td>10.7863/ultra.34.2.225</td>\n",
       "      <td>10.1016/j.acra.2008.01.010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>137886</th>\n",
       "      <td>10.7863/ultra.34.2.225</td>\n",
       "      <td>10.1016/s1076-6332(97)80154-7</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5989592 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 doi                          references\n",
       "5       10.1016/j.amjmed.2011.07.029                  10.1200/jop.091098\n",
       "5       10.1016/j.amjmed.2011.07.029        10.1001/archinte.163.21.2625\n",
       "5       10.1016/j.amjmed.2011.07.029    10.1046/j.1365-2710.2002.00434.x\n",
       "5       10.1016/j.amjmed.2011.07.029  10.1097/01.jac.0000290402.89284.a9\n",
       "5       10.1016/j.amjmed.2011.07.029                 10.1197/jamia.m3200\n",
       "...                              ...                                 ...\n",
       "137886        10.7863/ultra.34.2.225        10.1097/sla.0b013e318204a892\n",
       "137886        10.7863/ultra.34.2.225       10.1016/s0002-9610(03)00042-4\n",
       "137886        10.7863/ultra.34.2.225             10.1186/1471-2407-9-335\n",
       "137886        10.7863/ultra.34.2.225          10.1016/j.acra.2008.01.010\n",
       "137886        10.7863/ultra.34.2.225       10.1016/s1076-6332(97)80154-7\n",
       "\n",
       "[5989592 rows x 2 columns]"
      ]
     },
     "execution_count": 90,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b2ca96d6",
   "metadata": {},
   "source": [
    "## Querying"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "d22655c3",
   "metadata": {},
   "outputs": [],
   "source": [
    "#check the examples"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "234af03c",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_openai import ChatOpenAI\n",
    "\n",
    "graph = Neo4jGraph(url=\"bolt://localhost:7687\", username=\"neo4j\", password=\"Stargate90\", database=\"smallstc-upd\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "7f0006a5",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts.prompt import PromptTemplate\n",
    "\n",
    "CYPHER_GENERATION_TEMPLATE = \"\"\"Task:Generate Cypher statement to query a graph database.\n",
    "Instructions:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided.\n",
    "Schema:\n",
    "{schema}\n",
    "Note: Do not include any explanations or apologies in your responses.\n",
    "Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "Do not include any text except the generated Cypher statement.\n",
    "Examples: Here are a few examples of generated Cypher statements for particular questions:\n",
    "# List the titles of articles written by John Doe.\n",
    "MATCH (a:author {given: \"John\", family: \"Doe\"})<-[:AUTHORED_BY]-(art:article)\n",
    "RETURN art.title\n",
    "\n",
    "# Find all articles that reference the article with DOI '10.1234/abc123'.\n",
    "MATCH (a:article {doi: \"10.1234/abc123\"})<-[:REFERENCES]-(referenced_by:article)\n",
    "RETURN referenced_by.doi, referenced_by.title\n",
    "\n",
    "# Get the authors, titles, and citation counts of the most cited articles tagged with 'Breast Neoplasms'.\n",
    "MATCH (t:tag {name: \"Breast Neoplasms\"})-[:RELATED_TO*0..]->(subTag:tag)\n",
    "MATCH (a:article)-[:TAGGED_WITH]->(subTag)\n",
    "OPTIONAL MATCH (a)<-[:REFERENCES]-(citingArticle:article)\n",
    "OPTIONAL MATCH (a)-[:AUTHORED_BY]->(auth:author)\n",
    "RETURN a.title, count(citingArticle) AS citationCount, collect(DISTINCT auth.given + \" \" + auth.family) AS authors\n",
    "ORDER BY citationCount DESC\n",
    "LIMIT 10\n",
    "\n",
    "\n",
    "The question is:\n",
    "{question}\"\"\"\n",
    "\n",
    "CYPHER_GENERATION_PROMPT = PromptTemplate(\n",
    "    input_variables=[\"schema\", \"question\"], template=CYPHER_GENERATION_TEMPLATE\n",
    ")\n",
    "\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    ChatOpenAI(model=\"gpt-4o\", api_key=api_key, temperature=0), graph=graph, verbose=True, validate_cypher=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "811e43ff",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (a:article)-[:REFERENCES]->(b:article {doi: \"10.1016/s0002-9394(02)01522-2\"})\n",
      "RETURN count(a)\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'count(a)': 14}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'14 articles reference doi: 10.1016/s0002-9394(02)01522-2.'"
      ]
     },
     "execution_count": 94,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(\"How many articles reference doi: 10.1016/s0002-9394(02)01522-2?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "5f03e69d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (a:author {given: \"Matthew\", family: \"Nilsson\"})<-[:AUTHORED_BY]-(art:article)-[:AUTHORED_BY]->(coauthor:author)\n",
      "RETURN coauthor.given, coauthor.family, COUNT(*) AS collaborations\n",
      "ORDER BY collaborations DESC\n",
      "LIMIT 5\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'coauthor.given': 'Susan D', 'coauthor.family': 'Block', 'collaborations': 2}, {'coauthor.given': 'Jennifer W', 'coauthor.family': 'Mack', 'collaborations': 2}, {'coauthor.given': 'Holly G', 'coauthor.family': 'Prigerson', 'collaborations': 2}, {'coauthor.given': 'Elizabeth', 'coauthor.family': 'Trice', 'collaborations': 2}, {'coauthor.given': 'Alexi', 'coauthor.family': 'Wright', 'collaborations': 1}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Susan D. Block, Jennifer W. Mack, Holly G. Prigerson, and Elizabeth Trice are the top coauthors of Nilsson Matthew.'"
      ]
     },
     "execution_count": 95,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(\"Who are the top coauthors of Nilsson Matthew?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "c1d00802",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (a:author {family: \"Liu\", given: \"Yun\"})-[:AUTHORED_BY]-(art:article)-[:TAGGED_WITH]->(t:tag)\n",
      "RETURN DISTINCT t.name AS fields_of_study\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'fields_of_study': 'General Medicine'}, {'fields_of_study': 'Ophthalmology'}, {'fields_of_study': 'Anatomy'}, {'fields_of_study': 'Surgery'}, {'fields_of_study': 'Pathology and Forensic Medicine'}, {'fields_of_study': 'Multidisciplinary'}, {'fields_of_study': 'Medical Laboratory Technology'}, {'fields_of_study': 'Radiological and Ultrasound Technology'}, {'fields_of_study': 'Radiology, Nuclear Medicine and imaging'}, {'fields_of_study': 'Computer Vision and Pattern Recognition'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'General Medicine, Ophthalmology, Anatomy, Surgery, Pathology and Forensic Medicine, Multidisciplinary, Medical Laboratory Technology, Radiological and Ultrasound Technology, Radiology, Nuclear Medicine and imaging, Computer Vision and Pattern Recognition.'"
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(\"What are the fields of study of Liu Yun?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "02e813e2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Possible todo next: compare coauthors, but that's outside of the milestone"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "d7585637",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Possible todo next: Aldington\tStephen J == Aldington\tS J == Aldington\tS , but that's outside of the milestone"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
